JS & jQuery/react/dinosaur-api/app/controllers/dinosaurs_controller.rb

  def index
    @dinosaurs = Dinosaur.all
---
SELECT "dinosaurs".* FROM "dinosaurs"

  def create
    @dinosaur = Dinosaur.new(dinosaur_params)

    if @dinosaur.save
---
INSERT INTO "dinosaurs" ("name", "weight", "height", "image", "created_at", "updated_at", "dinosaur_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @dinosaur.update(dinosaur_params)
---
UPDATE "dinosaurs" SET "dinosaur_type" = $1, "updated_at" = $2 WHERE "dinosaurs"."id" = $3  [["dinosaur_type", "carnivor"], ["updated_at", 2017-04-28 09:27:26 UTC], ["id", 1]]

  def destroy
    @dinosaur.destroy
---
DELETE FROM "dinosaurs" WHERE "dinosaurs"."id" = $1  [["id", 1]]

  def set_dinosaur
    @dinosaur = Dinosaur.find(params[:id])
---
SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]